[
    {
        "title": "Healthcare Saves Money as well as Lives",
        "post": "Healthcare costs in America are higher than in any other country, and so the cost of obtaining healthcare is unaffordable for many. The Obama administration promised healthcare for all and instead made health insurance mandatory for all. The Affordable Care Act did open access to people with pre-existing conditions, and it enabled many to afford health insurance through government subsidies. Yet it did nothing to reduce healthcare costs, and many were unable to afford the co-pays after paying for the insurance premiums. The Trump administration has attempted to roll back any progress made by the ACA and to remove what affordability there was while offering nothing to replace it. What people need to realize is that healthcare for all saves money as well as lives. When people have access to healthcare when they need it, the expense of treating conditions is less than when they remain untreated until they have greatly worsened. Timely diagnosis and treatment also allows people to return to being contributing citizens and taxpayers sooner. Providing healthcare to all is in fact cost-effective and a sound investment.",
        "author": "AllTrumpedUp",
        "dateTime": "Sep. 15, 2017 23:45",
        "upvotes": 16,
        "downvotes": 2
    },
    {
        "title": "College Should Be for Education, Not Job Prep",
        "post": "Most students today go to college to train for a career, or at least to get a credential that opens doors to many jobs. Everyone is expected to have a bachelor's degree these days, even students who are inadequately prepared. Education in the liberal arts has become devalued. College should be for those who wish to learn. It is not for everyone. Those who only want to learn a trade or a profession should attend schools devoted to job training. Let colleges and universities be for scholars.",
        "author": "Friedrich OsterHaupf",
        "dateTime": "Oct. 18, 2017 23:45",
        "upvotes": 171,
        "downvotes": 350
    }
]